In [501]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\niyom\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\niyom\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\niyom\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [502]:
!pip install pandas sqlalchemy psycopg2
!pip install sqlalchemy pyodbc

Requirement already satisfied: pandas in c:\users\niyom\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: sqlalchemy in c:\users\niyom\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: psycopg2 in c:\users\niyom\anaconda3\lib\site-packages (2.9.10)
Requirement already satisfied: numpy>=1.26.0 in c:\users\niyom\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\niyom\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\niyom\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\niyom\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\niyom\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\niyom\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\users\niyom\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: sqlalchemy in c:\users\niyom\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: pyodbc in c:\users\niyom\anaconda3\lib\site-packages (5.1.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\niyom\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\niyom\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

## making connection to the database

In [1]:
import pyodbc
import pandas as pd
from datetime import datetime

server = r'TESTING1\SQLEXPRESS'  # Correct the server name (if needed)
database = 'Store_booksDB'
username = 'testing1\\niyom'     # Escape the backslash properly
password = ''  # Empty, as Windows Authentication doesn't need a password here

# Using Windows Authentication
try:
    conn = pyodbc.connect(f'DRIVER={{ODBC Driver 17 for SQL Server}};'
                          f'SERVER={server};'
                          f'DATABASE={database};'
                          f'Trusted_Connection=yes;')
    print(" Connected to SQL Server successfully using Windows Authentication!")
except pyodbc.Error as e:
    print("Error connecting to SQL Server:", e)

 Connected to SQL Server successfully using Windows Authentication!

## connect to a datawarehouse

In [828]:
from sqlalchemy import create_engine
engine = create_engine(f"mssql+pyodbc://{username}:{password}@{server}/{database}?driver=ODBC+Driver+17+for+SQL+Server")

In [3]:

server = r'TESTING1\SQLEXPRESS'  # Correct the server name (if needed)
database = 'StoreBooksDW'
username = 'testing1\\niyom'     # Escape the backslash properly
password = ''  # Empty, as Windows Authentication doesn't need a password here

# Using Windows Authentication
try:
    conn1 = pyodbc.connect(f'DRIVER={{ODBC Driver 17 for SQL Server}};'
                          f'SERVER={server};'
                          f'DATABASE={database};'
                          f'Trusted_Connection=yes;')
    print(" Connected to SQL Server successfully using Windows Authentication!")
except pyodbc.Error as e:
    print(" Error connecting to SQL Server:", e)

 Connected to SQL Server successfully using Windows Authentication!

## create cursor object od source database

In [1057]:
# Create a cursor from the connection
cursor = conn.cursor()

## create cursor object od data warehouse database

In [1060]:
# Create a cursor from the connection
cursor1 = conn1.cursor()

### Extract from author table

In [1067]:
query = "SELECT * FROM author"
# Execute query and load results into a DataFrame
df = pd.read_sql(query, conn)
# Display the data
print(df.head())

   author_id           author_name
0          1  A. Bartlett Giamatti
1          2   A. Elizabeth Delany
2          3            A. Merritt
3          4      A. Roger Merrill
4          5        A. Walton Litz

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\2298771866.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

#### Extract data from address table

In [950]:
query = "SELECT TOP 10 * FROM address"

# Execute query and load results into a DataFrame
df = pd.read_sql(query, conn)

# Display the data
print(df.head())

   address_id street_number          street_name          city  country_id
0           1            57  Glacier Hill Avenue  Torbat-e Jam          95
1           2            86      Dottie Junction      Beaumont          37
2           3           292        Ramsey Avenue       Cayambe          60
3           4          5618   Thackeray Junction        Caldas          47
4           5             4             2nd Park      Ngunguru         153

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1985813340.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

#### Extract data from book table

In [953]:
query = "SELECT TOP 10 * FROM book"

# Execute query and load results into a DataFrame
df = pd.read_sql(query, conn)

# Display the data
print(df.head())

   book_id                                              title       isbn13  \
0        1        The World's First Love: Mary  Mother of God   8987059752
1        2                                     The Illuminati  20049130001
2        3                                 The Servant Leader  23755004321
3        4  What Life Was Like in the Jewel in the Crown: ...  34406054602
4        5  Cliffs Notes on Aristophanes' Lysistrata  The ...  49086007763

   language_id  num_pages publication_date  publisher_id
0            2        276       1996-09-01          1010
1            1        352       2004-10-04          1967
2            1        128       2003-03-11          1967
3            1        168       1999-09-01          1978
4            1         80       1983-12-29           416

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\3432086728.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

## Extract data from book

In [956]:

# Example: Fetch data from a table
cursor.execute("SELECT * FROM book")

# Fetch all the rows
# rows = cursor.fetchall()
rows = cursor.fetchmany(5)
# Display the rows
for row in rows:
    print(row)

(1, "The World's First Love: Mary  Mother of God", '8987059752', 2, 276, datetime.date(1996, 9, 1), 1010)
(2, 'The Illuminati', '20049130001', 1, 352, datetime.date(2004, 10, 4), 1967)
(3, 'The Servant Leader', '23755004321', 1, 128, datetime.date(2003, 3, 11), 1967)
(4, 'What Life Was Like in the Jewel in the Crown: British India  AD 1600-1905', '34406054602', 1, 168, datetime.date(1999, 9, 1), 1978)
(5, "Cliffs Notes on Aristophanes' Lysistrata  The Birds  The Clouds  The Frogs", '49086007763', 1, 80, datetime.date(1983, 12, 29), 416)

In [958]:
conn.commit()  # Save changes to the database

### Extract some column Data from the Source Database

In [961]:
import pandas as pd

# SQL query to extract data
query = "SELECT author_id, author_name FROM author"

# Execute query and load into Pandas DataFrame
df_author = pd.read_sql(query, conn)

# Show extracted data
print(df_author.head())

   author_id           author_name
0          1  A. Bartlett Giamatti
1          2   A. Elizabeth Delany
2          3            A. Merritt
3          4      A. Roger Merrill
4          5        A. Walton Litz

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1706445448.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_author = pd.read_sql(query, conn)

### print 5 columns

In [965]:
print(df.head())

   book_id                                              title       isbn13  \
0        1        The World's First Love: Mary  Mother of God   8987059752
1        2                                     The Illuminati  20049130001
2        3                                 The Servant Leader  23755004321
3        4  What Life Was Like in the Jewel in the Crown: ...  34406054602
4        5  Cliffs Notes on Aristophanes' Lysistrata  The ...  49086007763

   language_id  num_pages publication_date  publisher_id
0            2        276       1996-09-01          1010
1            1        352       2004-10-04          1967
2            1        128       2003-03-11          1967
3            1        168       1999-09-01          1978
4            1         80       1983-12-29           416

## Extract data from the source tables into Pandas dataframes

In [968]:
# Load source data into Pandas dataframes
customer_df = pd.read_sql("SELECT * FROM customer", conn)
customer_address_df = pd.read_sql("SELECT * FROM customer_address", conn)
cust_order_df = pd.read_sql("SELECT * FROM cust_order", conn)
address_df = pd.read_sql("SELECT * FROM address", conn)
address_status_df = pd.read_sql("SELECT * FROM address_status", conn)
country_df = pd.read_sql("SELECT * FROM country", conn)
book_df = pd.read_sql("SELECT * FROM book", conn)
book_author_df = pd.read_sql("SELECT * FROM book_author", conn)
order_df = pd.read_sql("SELECT * FROM cust_order", conn)
order_history_df = pd.read_sql("SELECT * FROM order_history", conn)
order_line_df = pd.read_sql("SELECT * FROM order_line", conn)
order_status_df = pd.read_sql("SELECT * FROM order_status", conn)
publisher_df = pd.read_sql("SELECT * FROM publisher", conn)
shipping_df = pd.read_sql("SELECT * FROM shipping_method", conn)
book_language_df = pd.read_sql("SELECT * FROM book_language", conn)

# Display first few rows
customer_df.head()

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customer_df = pd.read_sql("SELECT * FROM customer", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customer_address_df = pd.read_sql("SELECT * FROM customer_address", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cust_order_df = pd.read_sql("SELECT * FROM cust_order", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  address_df = pd.read_sql("SELECT * FROM address", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  address_status_df = pd.read_sql("SELECT * FROM address_status", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  country_df = pd.read_sql("SELECT * FROM country", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  book_df = pd.read_sql("SELECT * FROM book", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  book_author_df = pd.read_sql("SELECT * FROM book_author", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  order_df = pd.read_sql("SELECT * FROM cust_order", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  order_history_df = pd.read_sql("SELECT * FROM order_history", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  order_line_df = pd.read_sql("SELECT * FROM order_line", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  order_status_df = pd.read_sql("SELECT * FROM order_status", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  publisher_df = pd.read_sql("SELECT * FROM publisher", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  shipping_df = pd.read_sql("SELECT * FROM shipping_method", conn)
C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1107021903.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  book_language_df = pd.read_sql("SELECT * FROM book_language", conn)

   customer_id first_name last_name                   email
0            1     Ursola     Purdy      upurdy0@cdbaby.com
1            2   Ruthanne    Vatini       rvatini1@fema.gov
2            3     Reidar   Turbitt  rturbitt2@geocities.jp
3            4       Rich     Kirsz      rkirsz3@jalbum.net
4            5    Carline     Kupis        ckupis4@tamu.edu

In [970]:
address_df.head()

   address_id street_number          street_name          city  country_id
0           1            57  Glacier Hill Avenue  Torbat-e Jam          95
1           2            86      Dottie Junction      Beaumont          37
2           3           292        Ramsey Avenue       Cayambe          60
3           4          5618   Thackeray Junction        Caldas          47
4           5             4             2nd Park      Ngunguru         153

In [972]:
address_df.head()

   address_id street_number          street_name          city  country_id
0           1            57  Glacier Hill Avenue  Torbat-e Jam          95
1           2            86      Dottie Junction      Beaumont          37
2           3           292        Ramsey Avenue       Cayambe          60
3           4          5618   Thackeray Junction        Caldas          47
4           5             4             2nd Park      Ngunguru         153

In [974]:
publisher_df.head()

   publisher_id                 publisher_name
0             1                          10/18
1             2               1st Book Library
2             3              1st World Library
3             4  A & C Black (Childrens books)
4             5   A Harvest Book/Harcourt Inc.

## Transform Data and Load into Dimension Tables

### drop duplicates values

In [978]:
df = df_author.drop_duplicates()

### checking the null values

In [981]:
df_author.isnull().sum()

author_id      0
author_name    0
dtype: int64

In [983]:
book_language_df.isnull().sum()

language_id      0
language_code    0
language_name    0
dtype: int64

In [985]:
country_df.isnull().sum()

country_id      0
country_name    0
dtype: int64

In [987]:
customer_address_df.isnull().sum()

customer_id    0
address_id     0
status_id      0
dtype: int64

In [989]:
customer_df.isnull().sum()

customer_id    0
first_name     0
last_name      0
email          0
dtype: int64

In [991]:
# Define your SQL query
query = """
SELECT method_id, method_name,cost
FROM shipping_method;
"""

# Execute the query
cursor.execute(query)

# Fetch the result
results = cursor.fetchmany(6)

# Print the results
for row in results:
    print(row)

(1, 'Standard', Decimal('5.90'))
(2, 'Priority', Decimal('8.90'))
(3, 'Express', Decimal('11.90'))
(4, 'International', Decimal('24.50'))

In [993]:
country_dff=country_df[['country_name']]

In [995]:
New_customer_address_status= customer_address_df[['status_id']]
New_customer_address_customer_id = customer_address_df[['customer_id']]
New_customer_address_address_id = customer_address_df[['address_id']]

In [997]:
New_CustomerData_names = customer_df[['first_name', 'last_name', 'email' ]]
New_CustomerData_customer_id = customer_df[['customer_id']]

In [999]:
New_countryData_name = country_df[['country_name']]
New_countryData_country_id = country_df[['country_id']]

In [1001]:
NewaddressData_name = address_df[['street_name', 'city']]
NewaddressData_address_id = address_df[['address_id']]
New_customer_address_status

      status_id
0             1
1             1
2             1
3             1
4             1
...         ...
3345          1
3346          1
3347          1
3348          1
3349          1

[3350 rows x 1 columns]

#### Rename and concatenate columns of DimCustomerData

In [1004]:
current_date = datetime.now()

New_customer_address_customer_id = New_customer_address_customer_id.rename(columns={'customer_id':'customer_id_BK'})
New_customer_address_address_id  = New_customer_address_address_id .rename(columns={'address_id':'address_id_BK'})
New_countryData_country_id = New_countryData_country_id.rename(columns={'country_id':'country_id_BK'})
NewaddressData_address_id =NewaddressData_address_id.rename(columns={'address_id':'status_id_BK'})
New_customer_address_status = New_customer_address_status.rename(columns={'status_id':'address_status'})


DimCustomerData = pd.concat([
                         New_customer_address_customer_id,                        
                         New_customer_address_address_id ,                         
                         New_countryData_country_id,                         
                         NewaddressData_address_id,
                         # New_customer_address_status,
                         New_CustomerData_names,
                         New_countryData_name,
                         NewaddressData_name, 
                         New_customer_address_status
                        ], 
                        axis=1, join='inner')
DimCustomerData['source_system_code'] = 'Store_booksDB'
DimCustomerData['start_date'] = pd.to_datetime('2022-12-31')
DimCustomerData['end_date'] = current_date 
DimCustomerData['is_current'] = 1

DimCustomerData

,customer_id_BK,address_id_BK,country_id_BK,status_id_BK,first_name,last_name,email,country_name,street_name,city,address_status,source_system_code,start_date,end_date,is_current
0,2,52,1,1,Ursola,Purdy,upurdy0@cdbaby.com,Afghanistan,Glacier Hill Avenue,Torbat-e Jam,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
1,2,346,2,2,Ruthanne,Vatini,rvatini1@fema.gov,Netherlands Antilles,Dottie Junction,Beaumont,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
2,4,150,3,3,Reidar,Turbitt,rturbitt2@geocities.jp,Albania,Ramsey Avenue,Cayambe,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
3,4,383,4,4,Rich,Kirsz,rkirsz3@jalbum.net,Algeria,Thackeray Junction,Caldas,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
4,4,479,5,5,Carline,Kupis,ckupis4@tamu.edu,Andorra,2nd Park,Ngunguru,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
227,152,522,228,228,Padriac,Karolyi,pkarolyi6b@mtv.com,Yugoslavia,Thompson Terrace,Velikiye Luki,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
228,153,699,229,229,Carrie,Arran,carran6c@dion.ne.jp,Zambia,Saint Paul Park,Izumo,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
229,154,626,230,230,Marlane,Graveson,mgraveson6d@slate.com,Zimbabwe,Kinsman Point,Heqiao,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
230,154,849,231,231,Pavla,Marzello,pmarzello6e@oracle.com,Singapore,Carberry Parkway,Novo Hamburgo,1,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1
231,156,31,232,232,Marti,Cassely,mcassely6f@japanpost.jp,French Polynesia,Utah Circle,Bilhorod-Dnistrovs’kyy,2,Store_booksDB,2022-12-31,2025-03-29 19:49:19.387157,1

### Loading Data to DimCustomer

In [1007]:
insert_query = """INSERT INTO DimCustomer (customer_id_BK, address_id_BK, country_id_BK, status_id_BK, first_name, last_name, email, 
                        country_name, street_name, city, address_status, source_system_code, start_date, end_date, is_current
                        ) 
                        VALUES 
                        (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)"""

for index, row in DimCustomerData.iterrows():
    cursor1.execute(insert_query, (
        row['customer_id_BK'],
        row['address_id_BK'],
        row['country_id_BK'],
        row['status_id_BK'],
        row['first_name'],
        row['last_name'],
        row['email'],
        row['country_name'],
        row['street_name'],
        row['city'],
        row['address_status'],
        row['source_system_code'],
        row['start_date'],
        row['end_date'],
        row['is_current']
    ))
conn1.commit()


print("Data inserted successfully into dbo.DimCustomer table.")

Data inserted successfully into dbo.DimCustomer table.

### Extract book Data including end_date column

In [1010]:
# SQL Query to extract book data with all related information including end_date
book_query = """
SELECT 
    ROW_NUMBER() OVER (ORDER BY b.book_id) AS book_id_SC,
    b.book_id,
    b.language_id,
    ba.author_id,
    b.publisher_id,
    b.isbn13,
    b.publication_date,
    b.num_pages,
    bl.language_name,
    p.publisher_name,
    a.author_name,
    'GRAVITY_BOOKS' AS source_system_code,
    GETDATE() AS start_date,
    NULL AS end_date,  -- Added end_date column initialized as NULL for current records
    1 AS is_current
FROM book b
JOIN book_author ba ON b.book_id = ba.book_id
JOIN author a ON ba.author_id = a.author_id
JOIN publisher p ON b.publisher_id = p.publisher_id
JOIN book_language bl ON b.language_id = bl.language_id;
"""

# Extract Data into DataFrame
book_df = pd.read_sql(book_query, conn)

# Display Extracted Data
print("Extracted Book Data with end_date column:")
display(book_df.head(2))

# Verify column names and structure
#print("\nDataFrame Columns:")
#print(book_df.columns.tolist())

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\1191128488.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  book_df = pd.read_sql(book_query, conn)

Extracted Book Data with end_date column:

,book_id_SC,book_id,language_id,author_id,publisher_id,isbn13,publication_date,num_pages,language_name,publisher_name,author_name,source_system_code,start_date,end_date,is_current
0,1,1,2,2778,1010,8987059752,1996-09-01,276,United States English,Ignatius Press,Fulton J. Sheen,GRAVITY_BOOKS,2025-03-29 19:49:22.600,None,1
1,2,2,1,5049,1967,20049130001,2004-10-04,352,English,Thomas Nelson,Larry Burkett,GRAVITY_BOOKS,2025-03-29 19:49:22.600,None,1

### Selection of columns and Rename  from book_df

In [1013]:
# Transform book DataFrame to match shipping method structure
book = book_df[['book_id', 'language_id', 'author_id', 'publisher_id', 'isbn13', 
                'publication_date', 'num_pages', 'language_name', 'publisher_name', 
                'author_name', 'source_system_code']].copy()

# Rename columns to follow your naming convention
book = book.rename(columns={
    'book_id': 'book_id_bk',
    'language_id': 'language_id_BK',
    'author_id': 'author_id_BK',
    'publisher_id': 'publisher_id_BK',
    'isbn13': 'isbn13',
    'publication_date': 'publication_date',
    'num_pages': 'num_pages',
    'language_name': 'language_name',
    'publisher_name': 'publisher_name',
    'author_name': 'author_name',
    'source_system_code': 'source_system_code'
})

# Add the additional columns to match your book method query structure
book['book_id_SC'] = book.index + 1  # Create sequential ID like ROW_NUMBER()
book['start_date'] = pd.to_datetime('2022-12-31')
book['end_date'] = current_date 
book['is_current'] = 1

# Reorder columns to match your expected structure
book = book[['book_id_SC', 'book_id_bk', 'language_id_BK', 'author_id_BK', 'publisher_id_BK',
             'isbn13', 'publication_date', 'num_pages', 'language_name', 'publisher_name',
             'author_name', 'source_system_code', 'start_date', 'end_date', 'is_current']]

# Display the transformed DataFrame
print("Transformed Book Data:")
display(book.head())

# Verify column names and structure
print("\nDataFrame Columns:")
print(book.columns.tolist())

Transformed Book Data:

,book_id_SC,book_id_bk,language_id_BK,author_id_BK,publisher_id_BK,isbn13,publication_date,num_pages,language_name,publisher_name,author_name,source_system_code,start_date,end_date,is_current
0,1,1,2,2778,1010,8987059752,1996-09-01,276,United States English,Ignatius Press,Fulton J. Sheen,GRAVITY_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,1
1,2,2,1,5049,1967,20049130001,2004-10-04,352,English,Thomas Nelson,Larry Burkett,GRAVITY_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,1
2,3,3,1,4902,1967,23755004321,2003-03-11,128,English,Thomas Nelson,Kenneth H. Blanchard,GRAVITY_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,1
3,4,4,1,8651,1978,34406054602,1999-09-01,168,English,Time Life Medical,Time-Life Books,GRAVITY_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,1
4,5,5,1,8904,416,49086007763,1983-12-29,80,English,Cliffs Notes,W. John Campbell,GRAVITY_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,1

DataFrame Columns:
['book_id_SC', 'book_id_bk', 'language_id_BK', 'author_id_BK', 'publisher_id_BK', 'isbn13', 'publication_date', 'num_pages', 'language_name', 'publisher_name', 'author_name', 'source_system_code', 'start_date', 'end_date', 'is_current']

### Load Data into DimBook

In [1016]:
# Rename the column in your DataFrame to match the database
book = book.rename(columns={'book_id_SC': 'book_id_SK'})

# Then proceed with your MERGE operation
try:
    cursor1.execute("SET IDENTITY_INSERT DimBook ON")
    
    merge_query = """
    MERGE INTO DimBook AS target
    USING (VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)) 
    AS source(book_id_SK, book_id_BK, language_id_BK, author_id_BK, publisher_id_BK, 
             isbn13, publication_date, num_pages, language_name, publisher_name, 
             author_name, source_system_code, start_date, end_date, is_current)
    ON target.book_id_SK = source.book_id_SK
    WHEN MATCHED THEN
        UPDATE SET 
            book_id_BK = source.book_id_BK,
            language_id_BK = source.language_id_BK,
            author_id_BK = source.author_id_BK,
            publisher_id_BK = source.publisher_id_BK,
            isbn13 = source.isbn13,
            publication_date = source.publication_date,
            num_pages = source.num_pages,
            language_name = source.language_name,
            publisher_name = source.publisher_name,
            author_name = source.author_name,
            source_system_code = source.source_system_code,
            start_date = source.start_date,
            end_date = source.end_date,
            is_current = source.is_current
    WHEN NOT MATCHED THEN
        INSERT (book_id_SK, book_id_BK, language_id_BK, author_id_BK, publisher_id_BK, 
               isbn13, publication_date, num_pages, language_name, publisher_name, 
               author_name, source_system_code, start_date, end_date, is_current)
        VALUES (source.book_id_SK, source.book_id_BK, source.language_id_BK, 
               source.author_id_BK, source.publisher_id_BK, source.isbn13, 
               source.publication_date, source.num_pages, source.language_name, 
               source.publisher_name, source.author_name, source.source_system_code, 
               source.start_date, source.end_date, source.is_current);
    """
    
    for _, row in book.iterrows():
        cursor1.execute(merge_query, tuple(row))
        
finally:
    cursor1.execute("SET IDENTITY_INSERT DimBook OFF")
    conn1.commit()

## Select data from DimOrder

In [1019]:
query = """
SELECT sm.method_id AS method_id_bk, sm.method_name
FROM shipping_method sm
"""
dim_order_df = pd.read_sql(query, conn)
dim_order_df

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\2018308887.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dim_order_df = pd.read_sql(query, conn)

   method_id_bk    method_name
0             1       Standard
1             2       Priority
2             3        Express
3             4  International

### Add required column

In [1022]:
import pandas as pd
from datetime import datetime

# Add required columns
dim_order_df['source_system_code'] = 'STORE_BOOKS'  # Constant value
dim_order_df['start_date'] = pd.to_datetime('2022-12-31')  # Set current timestamp
dim_order_df['end_date'] = current_date   # Default to NULL
dim_order_df['is_current'] = True  # Mark as current record

## Load Data to DimOrder

In [1025]:
# Insert into DimOrder
for _, row in dim_order_df.iterrows():
    cursor1.execute("""
        INSERT INTO DimOrder (method_id_bk, method_name, source_system_code, start_date, end_date, is_current)
        VALUES (?, ?, ?, ?, ?, ?)
    """, row['method_id_bk'], row['method_name'], row['source_system_code'], row['start_date'], row['end_date'], row['is_current'])

conn1.commit()
print("DimOrder loaded successfully!")

DimOrder loaded successfully!

In [1027]:
dim_order_df.head()

,method_id_bk,method_name,source_system_code,start_date,end_date,is_current
0,1,Standard,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True
1,2,Priority,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True
2,3,Express,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True
3,4,International,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True

In [1050]:
dim_order_df.dropna()

,method_id_bk,method_name,source_system_code,start_date,end_date,is_current
0,1,Standard,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True
1,2,Priority,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True
2,3,Express,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True
3,4,International,STORE_BOOKS,2022-12-31,2025-03-29 19:49:19.387157,True

## Load data to DimDate table

In [1030]:
query = "SELECT date_id_SK, year, month, day, start_date, end_date, is_current FROM DimDate"
dim_date_df = pd.read_sql(query, conn1)
cursor1.execute("SET IDENTITY_INSERT DimDate ON;")

for _, row in dim_date_df.iterrows():
    cursor1.execute("""
        INSERT INTO DimDate (date_id_SK, year, month, day, start_date, end_date, is_current)
        SELECT ?, ?, ?, ?, ?, ?, ?
        WHERE NOT EXISTS (SELECT 1 FROM DimDate WHERE date_id_SK = ?)
    """, row.date_id_SK, row.year, row.month, row.day, row.start_date, row.end_date, row.is_current, row.date_id_SK)

conn1.commit()
print("DimDate loaded successfully!")


# # Enable IDENTITY_INSERT for DimDate to allow inserting into the identity column
# cursor1.execute("SET IDENTITY_INSERT DimBook OFF")
# cursor1.execute("SET IDENTITY_INSERT DimDate ON;")

# # Insert data into DimDate
# for _, row in dim_date_df.iterrows():
#     cursor1.execute("""
#         INSERT INTO DimDate (date_id_SK, year, month, day, start_date, end_date, is_current)
#         SELECT ?, ?, ?, ?, ?, ?, ?
#         WHERE NOT EXISTS (SELECT 1 FROM DimDate WHERE date_id_SK = ?)
#     """, row.date_id_SK, row.year, row.month, row.day, row.start_date, row.end_date, row.is_current, row.date_id_SK)

# # Disable IDENTITY_INSERT after inserting
# cursor1.execute("SET IDENTITY_INSERT DimDate OFF;")

# # Commit the transaction
# conn1.commit()
# print("DimDate loaded successfully!")

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\3599814534.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dim_date_df = pd.read_sql(query, conn1)

DimDate loaded successfully!

## Drop Duplicates Before Inserting

In [1033]:
# dim_date_df = dim_date_df.drop_duplicates(subset=['date_id_SK'])

In [1035]:
# try:
#     print(dim_date_df.head())  # Check if it exists
# except NameError:
#     print("dim_date_df is not defined!")

## FactOrder

In [1038]:
# SQL Query to extract fact order data with order_status
fact_order_query = """
SELECT 
    ROW_NUMBER() OVER (ORDER BY co.order_id, ol.line_id) AS order_id_SC,
    ol.line_id,
    co.order_id,
    oh.history_id,
    ol.book_id,                      -- Source system book_id
    co.customer_id,                  -- Source system customer_id
    co.shipping_method_id,           -- Source system method_id
    CONVERT(DATE, co.order_date) AS order_date_id,  -- Source date
    os.status_id,
    os.status_value AS order_status,  -- Added order_status column
    ol.price,
    sm.cost AS shipping_cost,
    'GRAVITY_BOOKS' AS source_system_code,
    GETDATE() AS created_at
FROM cust_order co
JOIN order_line ol ON co.order_id = ol.order_id
JOIN order_history oh ON co.order_id = oh.order_id
JOIN order_status os ON oh.status_id = os.status_id
JOIN shipping_method sm ON co.shipping_method_id = sm.method_id;
"""

# Extract Data into DataFrame
fact_order_df = pd.read_sql(fact_order_query, conn)

# Display Extracted Data
print("Extracted Fact Order Data with Status:")
display(fact_order_df.head())

# Verify column names and structure
print("\nDataFrame Columns:")
print(fact_order_df.columns.tolist())

# Show status value counts
print("\nOrder Status Distribution:")
print(fact_order_df['order_status'].value_counts())

C:\Users\niyom\AppData\Local\Temp\ipykernel_12968\21416746.py:26: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  fact_order_df = pd.read_sql(fact_order_query, conn)

Extracted Fact Order Data with Status:

,order_id_SC,line_id,order_id,history_id,book_id,customer_id,shipping_method_id,order_date_id,status_id,order_status,price,shipping_cost,source_system_code,created_at
0,1,731,1,1,4003,703,1,2023-05-31,1,Order Received,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
1,2,731,1,7548,4003,703,1,2023-05-31,2,Pending Delivery,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
2,3,731,1,16580,4003,703,1,2023-05-31,3,Delivery In Progress,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
3,4,731,1,19953,4003,703,1,2023-05-31,4,Delivered,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
4,5,13637,1,19953,10617,703,1,2023-05-31,4,Delivered,13.02,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500

DataFrame Columns:
['order_id_SC', 'line_id', 'order_id', 'history_id', 'book_id', 'customer_id', 'shipping_method_id', 'order_date_id', 'status_id', 'order_status', 'price', 'shipping_cost', 'source_system_code', 'created_at']

Order Status Distribution:
order_status
Order Received          15393
Pending Delivery        13887
Delivery In Progress     8138
Delivered                7207
Cancelled                 613
Returned                  415
Name: count, dtype: int64

###  Rename  the columns

In [1040]:
fact= fact_order_df[['order_id_SC','line_id', 'order_id','history_id','book_id','customer_id','shipping_method_id','status_id','order_date_id','order_status'
               ,'price','shipping_cost','source_system_code','created_at']]
fact = fact .rename(columns={'order_id_SC': 'order_id_SK', 'line_id': 'line_id', 'order_id': 'order_id_BK', 'history_id': 'order_history_id',
                                    'book_id': 'book_id',
                                    'customer_id': 'customer_id',
                                    'shipping_method_id': 'shipping_id',
                                    'status_id': 'order_status_id',
                                    'order_date': 'order_date_id',
                                    'order_status': 'order_status',
                                    'price': 'price',
                                    'shipping_cost': 'shipping_cost',
                                    'source_system_code': 'source_system_code',
                                    'created_at	': 'created_at	'})
fact.head(2)

,order_id_SK,line_id,order_id_BK,order_history_id,book_id,customer_id,shipping_id,order_status_id,order_date_id,order_status,price,shipping_cost,source_system_code,created_at
0,1,731,1,1,4003,703,1,1,2023-05-31,Order Received,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
1,2,731,1,7548,4003,703,1,2,2023-05-31,Pending Delivery,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500

### Load the Data into FactOrder table

In [1044]:
# Proceed with your MERGE operation
import pandas as pd
from datetime import datetime  # Add this import at the top of your script
try:
    # First turn off any existing IDENTITY_INSERT
    cursor1.execute("SET IDENTITY_INSERT DimOrder OFF")
    cursor1.execute("SET IDENTITY_INSERT DimDate OFF")
    cursor1.execute("SET IDENTITY_INSERT DimBook OFF")
    cursor1.execute("SET IDENTITY_INSERT DimCustomer OFF")
    cursor1.execute("SET IDENTITY_INSERT FactOrder ON")
    fact['order_date_id'] = pd.to_datetime(fact['order_date_id'], errors='coerce')

    fact['order_date_id'] = fact['order_date_id'].dt.strftime('%Y%m%d').astype(int)

    merge_query = """
    MERGE INTO FactOrder AS target
    USING (VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)) 
    AS source(order_id_SK, line_id, order_id_BK, order_history_id, book_id, 
             customer_id, shipping_id, order_status_id, order_date_id, order_status, 
             price, shipping_cost, source_system_code, created_at)
    ON target.order_id_SK = source.order_id_SK
    WHEN MATCHED THEN
        UPDATE SET 
            line_id = source.line_id,
            order_id_BK = source.order_id_BK,
            order_history_id = source.order_history_id,
            book_id = source.book_id,
            customer_id = source.customer_id,
            shipping_id = source.shipping_id,
            order_status_id = source.order_status_id,
            order_date_id = source.order_date_id,
            order_status = source.order_status,
            price = source.price,
            shipping_cost = source.shipping_cost,
            source_system_code = source.source_system_code,
            created_at = source.created_at  -- REMOVED THE TRAILING COMMA HERE
    WHEN NOT MATCHED THEN
        INSERT (order_id_SK, line_id, order_id_BK, order_history_id, book_id, 
             customer_id, shipping_id, order_status_id, order_date_id, order_status, 
             price, shipping_cost, source_system_code, created_at)
        VALUES (source.order_id_SK, source.line_id, source.order_id_BK, 
               source.order_history_id, source.book_id, source.customer_id, 
               source.shipping_id, source.order_status_id, source.order_date_id, 
               source.order_status, source.price, source.shipping_cost, source.source_system_code, 
               source.created_at);
    """
    
    for _, row in fact.iterrows():
        cursor1.execute(merge_query, tuple(row))
        
finally:
    cursor1.execute("SET IDENTITY_INSERT FactOrder OFF")
    conn1.commit()

In [1045]:
fact.head()

,order_id_SK,line_id,order_id_BK,order_history_id,book_id,customer_id,shipping_id,order_status_id,order_date_id,order_status,price,shipping_cost,source_system_code,created_at
0,1,731,1,1,4003,703,1,1,20230531,Order Received,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
1,2,731,1,7548,4003,703,1,2,20230531,Pending Delivery,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
2,3,731,1,16580,4003,703,1,3,20230531,Delivery In Progress,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
3,4,731,1,19953,4003,703,1,4,20230531,Delivered,15.24,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500
4,5,13637,1,19953,10617,703,1,4,20230531,Delivered,13.02,5.9,GRAVITY_BOOKS,2025-03-29 19:50:14.500

In [1046]:
print(fact.dtypes)

order_id_SK                    int64
line_id                        int64
order_id_BK                    int64
order_history_id               int64
book_id                        int64
customer_id                    int64
shipping_id                    int64
order_status_id                int64
order_date_id                  int32
order_status                  object
price                        float64
shipping_cost                float64
source_system_code            object
created_at            datetime64[ns]
dtype: object